# Can be used to toggle the export of footnotes
#+OPTIONS: f:t

# Set the header depth
#+OPTIONS: H:5

# Disable automatic toc
#+OPTIONS: toc:nil
#+OPTIONS: title:nil

# Can be used to enable unicode characters
# #+LATEX_COMPILER: lualatex % Seems to prevent row-color highlighting
# #+LATEX_HEADER: \usepackage{unicode-math}
# #+LATEX_HEADER: \usepackage[utf8x]{inputenc}
# #+LATEX_HEADER: \usepackage[mathletters]{ucs}

#+LATEX_HEADER: \setcounter{secnumdepth}{5}

#+TITLE: Robust, Intuitive Programming Language (~ripl~)
#+SUBTITLE: Motivation, Design, and Implementation
#+AUTHOR: Ian McCall
#+LATEX_HEADER: \usepackage[margin=0.6in]{geometry}

#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{cmbright}
# #+LATEX_HEADER: \usepackage[scale=0.9]{sourcecodepro}
#+LATEX_HEADER: \usepackage{sourcecodepro}

#+LATEX_HEADER: \setcounter{tocdepth}{4}

# increase space between table and caption
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \captionsetup[table]{skip=10pt}

# allows use of the H option for force a float to Here
#+LATEX_HEADER: \usepackage{float}

#+LATEX_HEADER: \usepackage{multicol}

#+LATEX_HEADER: \usepackage{adjustbox}

# Set size of verbatim font used in "example" orb blocks
#+LATEX_HEADER: \usepackage{verbatim}
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \def\verbatim@font{\fontsize{10}{10}\ttfamily}

#+LATEX_HEADER: \usepackage[utf8]{inputenc}

#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[dvipsnames, table]{xcolor}

#+LATEX_HEADER: \usepackage{titlesec}

# enables highlighting on inline code
# (requires redefining \texttt as well, see below)
#+LATEX_HEADER: \usepackage{soul}

# hyperlinke colors
#+LATEX_HEADER: \hypersetup{ colorlinks=true, linkcolor=black, urlcolor=blue }

# Used for both bulleted and enumerated lists
#+LATEX_HEADER: \usepackage{enumitem}

# Customize bulleted lists
#+LATEX_HEADER:  \setlist{noitemsep, topsep=4pt, itemsep=3pt}
#+LATEX_HEADER:  \setlistdepth{9}
** Language Feature Table
#+BEGIN_EXPORT latex
(See the next page.)
#+END_EXPORT


#+BEGIN_EXPORT latex
\begin{sidewaystable}[htbp]
\caption{Language Feature Table}
\resizebox{\textwidth}{!}{
\rowcolors{1}{}{gray!15}
#+END_EXPORT
#+NAME: language-feature-table
|                                  | C   | C++ | C#  | D   | Haskell | Java | JavaScript | LLVM-IR | ML  | Python | ~ripl~ | Rust | Scala | Scheme |
|----------------------------------+-----+-----+-----+-----+---------+------+------------+---------+-----+--------+--------+------+-------+--------|
| Garbage Collection               | =-= | =-= | =+= | =+= | =+=     | =+=  | =+=        | =?=     | =+= | =+=    | =?=    | =-=  | =+=   | =+=    |
| Explicit Indirection             | =+= | =+= | =-= | =+= | =-=     | =-=  | =-=        | =+=     | =-= | =-=    | =+=    | =+=  | =-=   | =-=    |
| Ownership System                 | =-= | =-= | =-= | =-= | =-=     | =-=  | =-=        | =-=     | =-= | =-=    | =?=    | =+=  | =-=   | =-=    |
| Memory Safety                    | =-= | =-= | =+= | =+= | =+=     | =+=  | =+=        | =-=     | =+= | =+=    | =+=    | =+=  | =+=   | =+=    |
| Static Typing                    | =+= | =+= | =+= | =+= | =+=     | =+=  | =-=        | =+=     | =+= | =-=    | =+=    | =+=  | =+=   | =-=    |
| Type Inference                   | =-= | =+= | =+= | =+= | =+=     | =-=  | =?=        | =-=     | =+= | =?=    | =+=    | =+=  | =+=   | =?=    |
| Sub-typing                       | =+= | =+= | =+= | =+= | =-=     | =+=  | =+=        | =-=     | =-= | =+=    | =+=    | =-=  | =+=   | =-=    |
| Parametric Polymorphism          | =-= | =+= | =+= | =+= | =+=     | =+=  | =?=        | =-=     | =+= | =?=    | =+=    | =+=  | =+=   | =?=    |
| Type Classes                     | =-= | =-= | =-= | =-= | =+=     | =-=  | =?=        | =-=     | =+= | =-=    | =+=    | =+=  | =-=   | =-=    |
| Type Level Programming           | =-= | =+= | =-= | =+= | =+=     | =-=  | =?=        | =-=     | =+= | =?=    | =+=    | =-=  | =+=   | =?=    |
| Ad-hoc Polymorphism              | =-= | =+= | =+= | =+= | =-=     | =+=  | =?=        | =-=     | =-= | =?=    | =+=    | =-=  | =+=   | =?=    |
| Classical Inheritance            | =-= | =+= | =+= | =+= | =-=     | =+=  | =-=        | =-=     | =-= | =+=    | =-=    | =-=  | =+=   | =-=    |
| Prototypal Inheritance           | =-= | =-= | =-= | =-= | =-=     | =-=  | =+=        | =-=     | =-= | =-=    | =-=    | =-=  | =-=   | =-=    |
| Strict Evaluation                | =+= | =+= | =+= | =+= | =-=     | =+=  | =+=        | =+=     | =+= | =+=    | =+=    | =+=  | =+=   | =+=    |
| Type-safe Discriminated Unions   | =-= | =-= | =-= | =+= | =+=     | =-=  | =-=        | =-=     | =+= | =-=    | =+=    | =+=  | =+=   | =-=    |
| Null Safety                      | =-= | =-= | =-= | =-= | =+=     | =-=  | =-=        | =-=     | =+= | =-=    | =+=    | =+=  | =-=   | =+=    |
| Pattern Matching                 | =-= | =-= | =-= | =-= | =+=     | =-=  | =-=        | =-=     | =+= | =-=    | =+=    | =+=  | =+=   | =-=    |
| Mutable Data                     | =+= | =+= | =+= | =+= | =-=     | =+=  | =+=        | =+=     | =+= | =+=    | =+=    | =+=  | =+=   | =+=    |
| Immutable Data                   | =-= | =+= | =-= | =+= | =+=     | =-=  | =-=        | =-=     | =+= | =-=    | =+=    | =+=  | =+=   | =-=    |
| Constraints on Mutability        | =-= | =+= | =-= | =+= | =-=     | =-=  | =-=        | =-=     | =-= | =-=    | =+=    | =+=  | =-=   | =-=    |
| Constraints on Function Purity   | =-= | =-= | =-= | =+= | =+=     | =-=  | =-=        | =-=     | =-= | =-=    | =+=    | =-=  | =-=   | =-=    |
| C-style Syntax                   | =+= | =+= | =+= | =+= | =-=     | =+=  | =+=        | =-=     | =-= | =+=    | =-=    | =+=  | =+=   | =-=    |
| Header Files                     | =+= | =+= | =-= | =-= | =-=     | =-=  | =-=        | =-=     | =-= | =-=    | =-=    | =-=  | =-=   | =-=    |
| Whitespace Sensitive             | =-= | =-= | =-= | =-= | =+=     | =-=  | =-=        | =-=     | =-= | =+=    | =+=    | =-=  | =-=   | =-=    |
| Uniform Syntax                   | =-= | =-= | =-= | =-= | =-=     | =-=  | =-=        | =-=     | =-= | =-=    | =+=    | =-=  | =-=   | =+=    |
| Expression Oriented              | =-= | =-= | =-= | =-= | =+=     | =-=  | =-=        | =-=     | =+= | =-=    | =+=    | =+=  | =+=   | =+=    |
| Top Level Functions              | =+= | =+= | =-= | =+= | =+=     | =-=  | =+=        | =+=     | =+= | =+=    | =+=    | =+=  | =-=   | =+=    |
| Methods                          | =-= | =+= | =+= | =+= | =-=     | =+=  | =+=        | =-=     | =?= | =+=    | =-=    | =-=  | =+=   | =-=    |
| Uniform Function Call Syntax     | =?= | =-= | =?= | =+= | =?=     | =?=  | =-=        | =-=     | =?= | =-=    | =+=    | =+=  | =?=   | =?=    |
| Compile Time Function Evaluation | =-= | =+= | =-= | =+= | =-=     | =-=  | =?=        | =-=     | =-= | =?=    | =+=    | =-=  | =-=   | =?=    |
| Closures                         | =-= | =+= | =+= | =+= | =+=     | =+=  | =+=        | =-=     | =+= | =+=    | =+=    | =+=  | =+=   | =+=    |

#+BEGIN_EXPORT latex
} % end resizebox
\end{sidewaystable}
\pagebreak % without this pagebreak, the table may not land in the right section
#+END_EXPORT

#+NAME: export-language-feature-table-to-csv
#+BEGIN_SRC emacs-lisp :var table=language-feature-table :results none :exports none :colnames no
(with-temp-file "doc/figures/language-features/table.csv"
  (insert (format "%s"
    (concat
      (mapconcat
        (lambda (row)
          (mapconcat
            (lambda (cell)
              (cond
                ((equal cell "~ripl~") "ripl")
                ((equal cell "=-=") "-1")
                ((equal cell "=?=") "+0")
                ((equal cell "=+=") "+1")
                (t cell)))
            (remove "" row) ","))
        table "\n")
    "\n"))))
#+END_SRC

#+NAME: language-feature-table-balanced-ternary
#+BEGIN_SRC emacs-lisp :var table=language-feature-table :results value :exports none :colnames no
(mapcar
  (lambda (row)
    (mapcar
      (lambda (cell)
        (cond
          ((equal cell "~ripl~") "ripl")
          ((equal cell "=-=") -1)
          ((equal cell "=?=") +0)
          ((equal cell "=+=") +1)
          (t cell)))
    row))
  table)
#+END_SRC

#+RESULTS: language-feature-table-balanced-ternary
|                                  |  C | C++ | C# |  D | Haskell | Java | JavaScript | LLVM-IR | ML | Python | ripl | Rust | Scala | Scheme |
| Garbage Collection               | -1 |  -1 |  1 |  1 |       1 |    1 |          1 |       0 |  1 |      1 |    0 |   -1 |     1 |      1 |
| Explicit Indirection             |  1 |   1 | -1 |  1 |      -1 |   -1 |         -1 |       1 | -1 |     -1 |    1 |    1 |    -1 |     -1 |
| Ownership System                 | -1 |  -1 | -1 | -1 |      -1 |   -1 |         -1 |      -1 | -1 |     -1 |    0 |    1 |    -1 |     -1 |
| Memory Safety                    | -1 |  -1 |  1 |  1 |       1 |    1 |          1 |      -1 |  1 |      1 |    1 |    1 |     1 |      1 |
| Static Typing                    |  1 |   1 |  1 |  1 |       1 |    1 |         -1 |       1 |  1 |     -1 |    1 |    1 |     1 |     -1 |
| Type Inference                   | -1 |   1 |  1 |  1 |       1 |   -1 |          0 |      -1 |  1 |      0 |    1 |    1 |     1 |      0 |
| Sub-typing                       |  1 |   1 |  1 |  1 |      -1 |    1 |          1 |      -1 | -1 |      1 |    1 |   -1 |     1 |     -1 |
| Parametric Polymorphism          | -1 |   1 |  1 |  1 |       1 |    1 |          0 |      -1 |  1 |      0 |    1 |    1 |     1 |      0 |
| Type Classes                     | -1 |  -1 | -1 | -1 |       1 |   -1 |          0 |      -1 |  1 |     -1 |    1 |    1 |    -1 |     -1 |
| Type Level Programming           | -1 |   1 | -1 |  1 |       1 |   -1 |          0 |      -1 |  1 |      0 |    1 |   -1 |     1 |      0 |
| Ad-hoc Polymorphism              | -1 |   1 |  1 |  1 |      -1 |    1 |          0 |      -1 | -1 |      0 |    1 |   -1 |     1 |      0 |
| Classical Inheritance            | -1 |   1 |  1 |  1 |      -1 |    1 |         -1 |      -1 | -1 |      1 |   -1 |   -1 |     1 |     -1 |
| Prototypal Inheritance           | -1 |  -1 | -1 | -1 |      -1 |   -1 |          1 |      -1 | -1 |     -1 |   -1 |   -1 |    -1 |     -1 |
| Strict Evaluation                |  1 |   1 |  1 |  1 |      -1 |    1 |          1 |       1 |  1 |      1 |    1 |    1 |     1 |      1 |
| Type-safe Discriminated Unions   | -1 |  -1 | -1 |  1 |       1 |   -1 |         -1 |      -1 |  1 |     -1 |    1 |    1 |     1 |     -1 |
| Null Safety                      | -1 |  -1 | -1 | -1 |       1 |   -1 |         -1 |      -1 |  1 |     -1 |    1 |    1 |    -1 |      1 |
| Pattern Matching                 | -1 |  -1 | -1 | -1 |       1 |   -1 |         -1 |      -1 |  1 |     -1 |    1 |    1 |     1 |     -1 |
| Mutable Data                     |  1 |   1 |  1 |  1 |      -1 |    1 |          1 |       1 |  1 |      1 |    1 |    1 |     1 |      1 |
| Immutable Data                   | -1 |   1 | -1 |  1 |       1 |   -1 |         -1 |      -1 |  1 |     -1 |    1 |    1 |     1 |     -1 |
| Constraints on Mutability        | -1 |   1 | -1 |  1 |      -1 |   -1 |         -1 |      -1 | -1 |     -1 |    1 |    1 |    -1 |     -1 |
| Constraints on Function Purity   | -1 |  -1 | -1 |  1 |       1 |   -1 |         -1 |      -1 | -1 |     -1 |    1 |   -1 |    -1 |     -1 |
| C-style Syntax                   |  1 |   1 |  1 |  1 |      -1 |    1 |          1 |      -1 | -1 |      1 |   -1 |    1 |     1 |     -1 |
| Header Files                     |  1 |   1 | -1 | -1 |      -1 |   -1 |         -1 |      -1 | -1 |     -1 |   -1 |   -1 |    -1 |     -1 |
| Whitespace Sensitive             | -1 |  -1 | -1 | -1 |       1 |   -1 |         -1 |      -1 | -1 |      1 |    1 |   -1 |    -1 |     -1 |
| Uniform Syntax                   | -1 |  -1 | -1 | -1 |      -1 |   -1 |         -1 |      -1 | -1 |     -1 |    1 |   -1 |    -1 |      1 |
| Expression Oriented              | -1 |  -1 | -1 | -1 |       1 |   -1 |         -1 |      -1 |  1 |     -1 |    1 |    1 |     1 |      1 |
| Top Level Functions              |  1 |   1 | -1 |  1 |       1 |   -1 |          1 |       1 |  1 |      1 |    1 |    1 |    -1 |      1 |
| Methods                          | -1 |   1 |  1 |  1 |      -1 |    1 |          1 |      -1 |  0 |      1 |   -1 |   -1 |     1 |     -1 |
| Uniform Function Call Syntax     |  0 |  -1 |  0 |  1 |       0 |    0 |         -1 |      -1 |  0 |     -1 |    1 |    1 |     0 |      0 |
| Compile Time Function Evaluation | -1 |   1 | -1 |  1 |      -1 |   -1 |          0 |      -1 | -1 |      0 |    1 |   -1 |    -1 |      0 |
| Closures                         | -1 |   1 |  1 |  1 |       1 |    1 |          1 |      -1 |  1 |      1 |    1 |    1 |     1 |      1 |

